doc/s-sql-o.org
#+TITLE: S-SQL Examples O
#+OPTIONS: num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+OPTIONS: ^:nil

* [[file:s-sql-examples.org][S-SQL Examples Home Page]]
| [[file:s-sql-a.org][A]]| [[file:s-sql-b.org][B]]| [[file:s-sql-c.org][C]]| [[file:s-sql-d.org][D]]| [[file:s-sql-e.org][E]]| [[file:s-sql-f.org][F]]| [[file:s-sql-g.org][G]]| [[file:s-sql-h.org][H]]| [[file:s-sql-i.org][I]]| [[file:s-sql-j.org][J]]| [[file:s-sql-k.org][K]]| [[file:s-sql-l.org][L]]| [[file:s-sql-m.org][M]]| [[file:s-sql-n.org][N]]| [[file:s-sql-o.org][O]]| [[file:s-sql-p.org][P]]| [[file:s-sql-r.org][R]]| [[file:s-sql-s.org][S]]| [[file:s-sql-t.org][T]]| [[file:s-sql-u.org][U]]| [[file:s-sql-v.org][V]]| [[file:s-sql-w.org][W]]|  [[file:s-sql-special-characters.org][Special Characters]]                        |  [[file:calling-postgresql-stored-functions.org][Calling Postgresql Stored Functions and Procedures]]|

* On
  :PROPERTIES:
  :CUSTOM_ID: on
  :END:
On is used in the join clauses. See the example below which returns a list of lists showing various types of items inside a database.
#+begin_src lisp
  (defun list-schema-table-type-owner (relkind-type)
    "Returns a list of lists showing the schema, the name, the type and the ownerwhere relkind-type is a list of strings where the strings are: c,r,v,i,S,c,t or f"
    (query (:order-by (:select (:as 'n.nspname 'Schema)
                               (:as 'c.relname 'Name)
                               (:as (:case ((:= 'c.relkind "r") "Table")
                                      ((:= 'c.relkind "v") "view")
                                      ((:= 'c.relkind "i") "index")
                                      ((:= 'c.relkind "S") "sequence")
                                      ((:= 'c.relkind "c") "composite")
                                      ((:= 'c.relkind "t") "TOAST")
                                      ((:= 'c.relkind "f") "foreign"))
                                    'Type)
                               (:as 'u.usename 'Owner)
                               (:as (:/ (:pg_total_relation_size 'c.oid) 1000) 'Size)
                               (:as 'c.reltuples 'Records)
                               (:as 'c.relhasindex 'Indexed)
                               (:as 'c.relchecks 'Constraints)
                               (:as 'c.relhastriggers 'Triggers)
                               (:as (:pg_size_pretty (:pg_total_relation_size 'c.oid)) 'Size)
                               :from (:as 'pg-catalog.pg-class 'c)
                               :left-join (:as 'pg-catalog.pg-user 'u)
                               :on (:= 'u.usesysid  'c.relowner)
                               :left-join (:as 'pg-catalog.pg-namespace  'n)
                               :on (:= 'n.oid  'c.relnamespace)
                               :where (:and (:in 'c.relkind (:set relkind-type ""))
                                            (:not-in 'n.nspname (:set "pg_catalog" "pg-toast"))
                                            (:pg-catalog.pg-table-is-visible 'c.oid)))
                      1 2)))
#+end_src

* On Conflict
  :PROPERTIES:
  :CUSTOM_ID: on-conflict
  :END:
Some people use the term "upsert" for trying to insert a new row, but if that record already exists, then either update the row with new values or do nothing (as opposed to throwing an error).

Beginning in postgresql versions 9.5 and above, it is possible to use what postgresql calls on-conflict. There are two versions - "on conflict do nothing" or "on conflict update". See below for sample call in postmodern for on-conflict-update.

#+begin_src lisp
(query (:insert-into 'test-table :set 'column-A '$1 'column-B '$2
                     :on-conflict-update 'column-A
                     :update-set 'column-B '$2
                     :where (:= 'test-table.column-A '$1)) "c" 37)

#+end_src

* Or
  :PROPERTIES:
  :CUSTOM_ID: or
  :END:
#+begin_src lisp
(query (:select 'countries.name :from 'countries 'regions
                :where (:and (:or (:= 'regions.name "North America")
                                  (:= 'regions.name "Central America"))
                             (:= 'regions.id 'countries.region-id))))

(("Belize") ("Bermuda") ("Canada") ("Costa Rica") ("El Salvador") ("Greenland")  ("Guatemala") ("Mexico") ("Panama") ("US") ("Nicaragua"))

#+end_src

