doc/s-sql-o.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 18:58 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples O</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples O</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0d474d8">S-SQL Examples Home Page</a></li>
<li><a href="#on">On</a></li>
<li><a href="#on-conflict">On Conflict</a></li>
<li><a href="#or">Or</a></li>
<li><a href="#order-by">Order-by</a>
<ul>
<li><a href="#order-by-with-limit">Order By with Limit and offset</a></li>
<li><a href="#orge039a1d">Order-by within an aggregation operator</a></li>
</ul>
</li>
<li><a href="#over">Over</a>
<ul>
<li><a href="#over-range-between">Over Range Between</a></li>
<li><a href="#org7d20afb">Over Row Between</a>
<ul>
<li><a href="#preceding">Preceding</a></li>
<li><a href="#current-row">Current-Row</a></li>
<li><a href="#unbounded">Unbounded</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org0d474d8" class="outline-2">
<h2 id="org0d474d8"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-org0d474d8">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-on" class="outline-2">
<h2 id="on">On</h2>
<div class="outline-text-2" id="text-on">
<p>
On is used in the join clauses. See the example below which returns a list of lists showing various types of items inside a database.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">list-schema-table-type-owner</span> (relkind-type)
  <span class="org-doc">"Returns a list of lists showing the schema, the name, the type and the ownerwhere relkind-type is a list of strings where the strings are: c,r,v,i,S,c,t or f"</span>
  (query (<span class="org-builtin">:order-by</span> (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> 'n.nspname 'Schema)
                             (<span class="org-builtin">:as</span> 'c.relname 'Name)
                             (<span class="org-builtin">:as</span> (<span class="org-builtin">:case</span> ((<span class="org-builtin">:=</span> 'c.relkind <span class="org-string">"r"</span>) <span class="org-string">"Table"</span>)
                                    ((<span class="org-builtin">:=</span> 'c.relkind <span class="org-string">"v"</span>) <span class="org-string">"view"</span>)
                                    ((<span class="org-builtin">:=</span> 'c.relkind <span class="org-string">"i"</span>) <span class="org-string">"index"</span>)
                                    ((<span class="org-builtin">:=</span> 'c.relkind <span class="org-string">"S"</span>) <span class="org-string">"sequence"</span>)
                                    ((<span class="org-builtin">:=</span> 'c.relkind <span class="org-string">"c"</span>) <span class="org-string">"composite"</span>)
                                    ((<span class="org-builtin">:=</span> 'c.relkind <span class="org-string">"t"</span>) <span class="org-string">"TOAST"</span>)
                                    ((<span class="org-builtin">:=</span> 'c.relkind <span class="org-string">"f"</span>) <span class="org-string">"foreign"</span>))
                                  'Type)
                             (<span class="org-builtin">:as</span> 'u.usename 'Owner)
                             (<span class="org-builtin">:as</span> (<span class="org-builtin">:/</span> (<span class="org-builtin">:pg_total_relation_size</span> 'c.oid) 1000) 'Size)
                             (<span class="org-builtin">:as</span> 'c.reltuples 'Records)
                             (<span class="org-builtin">:as</span> 'c.relhasindex 'Indexed)
                             (<span class="org-builtin">:as</span> 'c.relchecks 'Constraints)
                             (<span class="org-builtin">:as</span> 'c.relhastriggers 'Triggers)
                             (<span class="org-builtin">:as</span> (<span class="org-builtin">:pg_size_pretty</span> (<span class="org-builtin">:pg_total_relation_size</span> 'c.oid)) 'Size)
                             <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'pg-catalog.pg-class 'c)
                             <span class="org-builtin">:left-join</span> (<span class="org-builtin">:as</span> 'pg-catalog.pg-user 'u)
                             <span class="org-builtin">:on</span> (<span class="org-builtin">:=</span> 'u.usesysid  'c.relowner)
                             <span class="org-builtin">:left-join</span> (<span class="org-builtin">:as</span> 'pg-catalog.pg-namespace  'n)
                             <span class="org-builtin">:on</span> (<span class="org-builtin">:=</span> 'n.oid  'c.relnamespace)
                             <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:in</span> 'c.relkind (<span class="org-builtin">:set</span> relkind-type <span class="org-string">""</span>))
                                          (<span class="org-builtin">:not-in</span> 'n.nspname (<span class="org-builtin">:set</span> <span class="org-string">"pg_catalog"</span> <span class="org-string">"pg-toast"</span>))
                                          (<span class="org-builtin">:pg-catalog.pg-table-is-visible</span> 'c.oid)))
                    1 2)))
</pre>
</div>
</div>
</div>

<div id="outline-container-on-conflict" class="outline-2">
<h2 id="on-conflict">On Conflict</h2>
<div class="outline-text-2" id="text-on-conflict">
<p>
Some people use the term "upsert" for trying to insert a new row, but if that record already exists, then either update the row with new values or do nothing (as opposed to throwing an error).
</p>

<p>
Beginning in postgresql versions 9.5 and above, it is possible to use what postgresql calls on-conflict. There are two versions - "on conflict do nothing" or "on conflict update". See below for sample call in postmodern for on-conflict-update.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-into</span> 'test-table <span class="org-builtin">:set</span> 'column-A '$1 'column-B '$2
                     <span class="org-builtin">:on-conflict-update</span> 'column-A
                     <span class="org-builtin">:update-set</span> 'column-B '$2
                     <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'test-table.column-A '$1)) <span class="org-string"><span class="org-warning">"c"</span></span><span class="org-warning"> 37)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-or" class="outline-2">
<h2 id="or">Or</h2>
<div class="outline-text-2" id="text-or">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'countries.name <span class="org-builtin">:from</span> 'countries 'regions
                <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:or</span> (<span class="org-builtin">:=</span> 'regions.name <span class="org-string">"North America"</span>)
                                  (<span class="org-builtin">:=</span> 'regions.name <span class="org-string">"Central America"</span>))
                             (<span class="org-builtin">:=</span> 'regions.id 'countries.region-id))))

((<span class="org-string">"Belize"</span>) (<span class="org-string">"Bermuda"</span>) (<span class="org-string">"Canada"</span>) (<span class="org-string">"Costa Rica"</span>) (<span class="org-string">"El Salvador"</span>) (<span class="org-string">"Greenland"</span>)  (<span class="org-string">"Guatemala"</span>) (<span class="org-string">"Mexico"</span>) (<span class="org-string">"Panama"</span>) (<span class="org-string">"US"</span>) (<span class="org-string">"Nicaragua"</span>))

</pre>
</div>
</div>
</div>
