doc/s-sql-o.org
* Order-by
  :PROPERTIES:
  :CUSTOM_ID: order-by
  :END:
Order-by does what it says on the label. It is important to note that there are two uses of order-by. First is a wrapper around a select statement, effectively sorting the data returned by the select statement.:
#+begin_src lisp
(query (:order-by
        (:select 'id 'name
                 :from 'countries
                 :where (:>= 'name "W"))
        'name))

((115 "Wallis") (141 "Zambia") (142 "Zimbabwe"))
#+end_src

If you want to change the default from ascending to descending, then the relevant column name is enclosed in a :desc term like so:
#+begin_src lisp
(query (:order-by
        (:select 'id 'name
                 :from 'countries
                 :where (:>= 'name "W"))
        (:desc 'name)))

((142 "Zimbabwe") (141 "Zambia") (115 "Wallis") )
#+end_src

** Order By with Limit and offset
  :PROPERTIES:
  :CUSTOM_ID: order-by-with-limit
  :END:
Note that :order-by has one or more parameters [Just one in this example] and :limit has 2 possible parameters, the limit and the offset. Note that the :order-by and :limit forms are wrapped around the :select form. The only difference between the two queries is the offset parameter.
#+begin_src lisp
  (let ((list-limit 2) (offset 0))
    (query
     (:limit
      (:order-by
       (:select 'countries.id 'countries.name
                :from 'countries)
       'name)
      '$1 '$2)
     list-limit offset))

  ((82 "Afghanistan") (130 "Albania"))

  (let ((list-limit 2)
        (offset 2))
    (query
     (:limit
      (:order-by
       (:select 'countries.id 'countries.name
                :from 'countries)
       'name)
      '$1 '$2)
     list-limit offset))

  ((140 "Algeria") (34 "All"))

#+end_src

** Order-by within an aggregation operator

The second use of order-by is as a keyword parameter to an aggregation operator.

Since it is part of the aggregation operator rather than sorting the result of the aggregation operator, it is not a wrap around form as seen above.
* Over
  :PROPERTIES:
  :CUSTOM_ID: over
  :END:
Over is a part of [[https://www.postgresql.org/docs/current/tutorial-window.html][Postgresql window functions]]. "The OVER clause determines exactly how the rows of the query are split up for processing by the window function. The PARTITION BY clause within OVER divides the rows into groups, or partitions, that share the same values of the PARTITION BY expression(s). For each row, the window function is computed across the rows that fall into the same partition as the current row.

You can also control the order in which rows are processed by window functions using ORDER BY within OVER. (The window ORDER BY does not even have to match the order in which the rows are output.)"  See also the examples for partition-by

Here is an example:
#+begin_src lisp
  (query (:select 'salary (:over (:sum 'salary))
                :from 'empsalary))
#+end_src

Consider briefly at what "over" generates"
#+begin_src lisp
  (sql (:over 'x 'y))

"(x OVER y)"

(sql (:over 'x))

"(x OVER ())"

(sql (:over 'x 'y 'z))

"(x OVER y, z)"
#+end_src

So, if you wanted an sql statement such as:
#+begin_src lisp
 (query "select x, array_agg(x) over (order by x) from generate_series(1, 3) as t(x);")

((1 #(1)) (2 #(1 2)) (3 #(1 2 3)))
#+end_src

The postmodern version would be:
#+begin_src lisp
 (query (:select 'x
                (:over (:array-agg 'x)
                       (:order-by 'x))
                :from (:as (:generate-series 1 3)
                           (:t 'x))))

((1 #(1)) (2 #(1 2)) (3 #(1 2 3)))
#+end_src
** Over Range Between
   :PROPERTIES:
   :CUSTOM_ID: over-range-between
   :END:
#+begin_src lisp
  (query (:limit
          (:select (:as 'country 'country-name)
                   (:as 'population 'country-population)
                   (:as (:over (:sum 'population)
                               (:range-between :order-by 'country :unbounded-preceding
                                :unbounded-following))
                        'global-population)
           :from 'population
           :where (:and (:not-null 'iso2)
                        (:= 'year 1976)))
          5))
#+end_src
** Over Row Between
*** Preceding
   :PROPERTIES:
   :CUSTOM_ID: preceding
   :END:
#+begin_src lisp
  (query (:limit
             (:select (:as 'country 'country-name)
                      (:as 'population 'country-population)
                      (:as (:over (:sum 'population)
                                  (:rows-between :order-by 'country :preceding 2
                                                 :following 2))
                           'global-population)
                      :from 'population
                      :where (:and (:not-null 'iso2)
                                   (:= 'year 1976)))
             5))
#+end_src
*** Current-Row
   :PROPERTIES:
   :CUSTOM_ID: current-row
   :END:
#+begin_src lisp
  (query (:limit
             (:select (:as 'country 'country-name)
                      (:as 'population 'country-population)
                      (:as (:over (:sum 'population)
                                  (:rows-between :order-by 'country :current-row
                                   :following 2))
                           'global-population)
                      :from 'population
                      :where (:and (:not-null 'iso2)
                                   (:= 'year 1976)))
             5))
#+end_src
