doc/s-sql-o.html

<div id="outline-container-order-by" class="outline-2">
<h2 id="order-by">Order-by</h2>
<div class="outline-text-2" id="text-order-by">
<p>
Order-by does what it says on the label. It is important to note that there are two uses of order-by. First is a wrapper around a select statement, effectively sorting the data returned by the select statement.:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:order-by</span>
        (<span class="org-builtin">:select</span> 'id 'name
                 <span class="org-builtin">:from</span> 'countries
                 <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;=</span> 'name <span class="org-string">"W"</span>))
        'name))

((115 <span class="org-string">"Wallis"</span>) (141 <span class="org-string">"Zambia"</span>) (142 <span class="org-string">"Zimbabwe"</span>))
</pre>
</div>

<p>
If you want to change the default from ascending to descending, then the relevant column name is enclosed in a :desc term like so:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:order-by</span>
        (<span class="org-builtin">:select</span> 'id 'name
                 <span class="org-builtin">:from</span> 'countries
                 <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;=</span> 'name <span class="org-string">"W"</span>))
        (<span class="org-builtin">:desc</span> 'name)))

((142 <span class="org-string">"Zimbabwe"</span>) (141 <span class="org-string">"Zambia"</span>) (115 <span class="org-string">"Wallis"</span>) )
</pre>
</div>
</div>

<div id="outline-container-order-by-with-limit" class="outline-3">
<h3 id="order-by-with-limit">Order By with Limit and offset</h3>
<div class="outline-text-3" id="text-order-by-with-limit">
<p>
Note that :order-by has one or more parameters [Just one in this example] and :limit has 2 possible parameters, the limit and the offset. Note that the :order-by and :limit forms are wrapped around the :select form. The only difference between the two queries is the offset parameter.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((list-limit 2) (offset 0))
  (query
   (<span class="org-builtin">:limit</span>
    (<span class="org-builtin">:order-by</span>
     (<span class="org-builtin">:select</span> 'countries.id 'countries.name
              <span class="org-builtin">:from</span> 'countries)
     'name)
    '$1 '$2)
   list-limit offset))

((82 <span class="org-string">"Afghanistan"</span>) (130 <span class="org-string">"Albania"</span>))

(<span class="org-keyword">let</span> ((list-limit 2)
      (offset 2))
  (query
   (<span class="org-builtin">:limit</span>
    (<span class="org-builtin">:order-by</span>
     (<span class="org-builtin">:select</span> 'countries.id 'countries.name
              <span class="org-builtin">:from</span> 'countries)
     'name)
    '$1 '$2)
   list-limit offset))

((140 <span class="org-string">"Algeria"</span>) (34 <span class="org-string">"All"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-orge039a1d" class="outline-3">
<h3 id="orge039a1d">Order-by within an aggregation operator</h3>
<div class="outline-text-3" id="text-orge039a1d">
<p>
The second use of order-by is as a keyword parameter to an aggregation operator.
</p>

<p>
Since it is part of the aggregation operator rather than sorting the result of the aggregation operator, it is not a wrap around form as seen above.
</p>
</div>
</div>
</div>
<div id="outline-container-over" class="outline-2">
<h2 id="over">Over</h2>
<div class="outline-text-2" id="text-over">
<p>
Over is a part of <a href="https://www.postgresql.org/docs/current/tutorial-window.html">Postgresql window functions</a>. "The OVER clause determines exactly how the rows of the query are split up for processing by the window function. The PARTITION BY clause within OVER divides the rows into groups, or partitions, that share the same values of the PARTITION BY expression(s). For each row, the window function is computed across the rows that fall into the same partition as the current row.
</p>

<p>
You can also control the order in which rows are processed by window functions using ORDER BY within OVER. (The window ORDER BY does not even have to match the order in which the rows are output.)"  See also the examples for partition-by
</p>

<p>
Here is an example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'salary (<span class="org-builtin">:over</span> (<span class="org-builtin">:sum</span> 'salary))
              <span class="org-builtin">:from</span> 'empsalary))
</pre>
</div>

<p>
Consider briefly at what "over" generates"
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (sql (<span class="org-builtin">:over</span> 'x 'y))

<span class="org-string">"(x OVER y)"</span>

(sql (<span class="org-builtin">:over</span> 'x))

<span class="org-string">"(x OVER ())"</span>

(sql (<span class="org-builtin">:over</span> 'x 'y 'z))

<span class="org-string">"(x OVER y, z)"</span>
</pre>
</div>

<p>
So, if you wanted an sql statement such as:
</p>
<div class="org-src-container">
<pre class="src src-lisp"> (query <span class="org-string">"select x, array_agg(x) over (order by x) from generate_series(1, 3) as t(x);"</span>)

((1 #(1)) (2 #(1 2)) (3 #(1 2 3)))
</pre>
</div>

<p>
The postmodern version would be:
</p>
<div class="org-src-container">
<pre class="src src-lisp"> (query (<span class="org-builtin">:select</span> 'x
                (<span class="org-builtin">:over</span> (<span class="org-builtin">:array-agg</span> 'x)
                       (<span class="org-builtin">:order-by</span> 'x))
                <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:generate-series</span> 1 3)
                           (<span class="org-builtin">:t</span> 'x))))

((1 #(1)) (2 #(1 2)) (3 #(1 2 3)))
</pre>
</div>
</div>
<div id="outline-container-over-range-between" class="outline-3">
<h3 id="over-range-between">Over Range Between</h3>
<div class="outline-text-3" id="text-over-range-between">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:limit</span>
        (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> 'country 'country-name)
                 (<span class="org-builtin">:as</span> 'population 'country-population)
                 (<span class="org-builtin">:as</span> (<span class="org-builtin">:over</span> (<span class="org-builtin">:sum</span> 'population)
                             (<span class="org-builtin">:range-between</span> <span class="org-builtin">:order-by</span> 'country <span class="org-builtin">:unbounded-preceding</span>
                              <span class="org-builtin">:unbounded-following</span>))
                      'global-population)
         <span class="org-builtin">:from</span> 'population
         <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:not-null</span> 'iso2)
                      (<span class="org-builtin">:=</span> 'year 1976)))
        5))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7d20afb" class="outline-3">
<h3 id="org7d20afb">Over Row Between</h3>
<div class="outline-text-3" id="text-org7d20afb">
</div>
<div id="outline-container-preceding" class="outline-4">
<h4 id="preceding">Preceding</h4>
<div class="outline-text-4" id="text-preceding">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:limit</span>
           (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> 'country 'country-name)
                    (<span class="org-builtin">:as</span> 'population 'country-population)
                    (<span class="org-builtin">:as</span> (<span class="org-builtin">:over</span> (<span class="org-builtin">:sum</span> 'population)
                                (<span class="org-builtin">:rows-between</span> <span class="org-builtin">:order-by</span> 'country <span class="org-builtin">:preceding</span> 2
                                               <span class="org-builtin">:following</span> 2))
                         'global-population)
                    <span class="org-builtin">:from</span> 'population
                    <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:not-null</span> 'iso2)
                                 (<span class="org-builtin">:=</span> 'year 1976)))
           5))
</pre>
</div>
</div>
</div>
<div id="outline-container-current-row" class="outline-4">
<h4 id="current-row">Current-Row</h4>
<div class="outline-text-4" id="text-current-row">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:limit</span>
           (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> 'country 'country-name)
                    (<span class="org-builtin">:as</span> 'population 'country-population)
                    (<span class="org-builtin">:as</span> (<span class="org-builtin">:over</span> (<span class="org-builtin">:sum</span> 'population)
                                (<span class="org-builtin">:rows-between</span> <span class="org-builtin">:order-by</span> 'country <span class="org-builtin">:current-row</span>
                                 <span class="org-builtin">:following</span> 2))
                         'global-population)
                    <span class="org-builtin">:from</span> 'population
                    <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:not-null</span> 'iso2)
                                 (<span class="org-builtin">:=</span> 'year 1976)))
           5))
</pre>
</div>
</div>
</div>
