doc/s-sql-o.html
<div id="outline-container-unbounded" class="outline-4">
<h4 id="unbounded">Unbounded</h4>
<div class="outline-text-4" id="text-unbounded">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:limit</span>
           (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> 'population.country 'country-name)
                    (<span class="org-builtin">:as</span> 'population 'country-population)
                    'region-name
                    (<span class="org-builtin">:as</span> (<span class="org-builtin">:over</span> (<span class="org-builtin">:sum</span> 'population)
                                (<span class="org-builtin">:partition-by</span> 'region-name <span class="org-builtin">:order-by</span> 'population.country
                                 <span class="org-builtin">:range-between</span> <span class="org-builtin">:unbounded-preceding</span> <span class="org-builtin">:current-row</span>))
                         'regional-population)
                    <span class="org-builtin">:from</span> 'population
                    <span class="org-builtin">:inner-join</span> 'regions
                    <span class="org-builtin">:on</span> (<span class="org-builtin">:=</span> 'population.iso3 'regions.iso3)
                    <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:not-null</span> 'population.iso2)
                                 (<span class="org-builtin">:=</span> 'year 1976)))
           5))
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>